---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.GetEnumerator
source: html/decc5942-dc4a-7508-b82f-cd5fe5c12a65.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<MEPSize> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.